Table of Contents
 Class Polygon3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a polygon in three-dimensional space.
[OpenModelClass("CI.Geometry3D.Polygon3D,CI.Geometry3D")]
public class Polygon3D : OpenObject
Inheritance
object
OpenObject
Polygon3D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Polygon3D()
Contructor
public Polygon3D()
Properties
 Points
List of polygon points
public List<Point3D> Points { get; set; }
Property Value
List<Point3D>
 Edit this page